{
  "ingredients": [
    "1 Sweet Potato",
    "1/4 cup Uncooked Couscous",
    "1 Large Red Onion",
    "1 Small White Onion",
    "1/4 Tsp Cinnamon",
    "1/4 Tsp Cayenne (or more to taste)",
    "1/4 Cup Panko Bread Crumbs",
    "8 oz Arugula",
    "3 Tsp Thai Garlic Chili Paste",
    "1/4 Cup Mayo",
    "Salt and Pepper to taste",
    "1 1/2 Tsp Honey",
    "6 English Muffins",
    "1 T Olive Oil"
  ],
  "instructions": [
    "Preheat oven to 400 degrees Farenheit",
    "Put the water and cous cous into a small sauce pan. Bring to a boil and then simmer until all the water has evaporated. This should take about 2 - 3 min, so DON'T walk away.",
    "Chop the sweet potato into 1/2 inch cubes and place on a baking sheet. Drizzle the potatoes with olive oil, salt, and pepper. Once the oven is preheated, bake for 25 - 20 min (or until soft.)",
    "While the potatoes are baking, peel and dice half the white onion (should be about 1/4 of a cup) and place in a large bowl. Add the honey, cous cous, cinnamon, cayenne, salt, pepper, and panko bread crumbs to the large bowl with the onion.",
    "Set the onion/cous cous mixture aside and begin making the spicy mayo.",
    "Combine the Garlic Chilie Sauce and mayo in a small bowl and taste. Add more mayo or chilie sauce to the mixture to adjust for your spice preference. Set aside.",
    "Once the sweet potatoes are done, add them to the large bowl (onion/cous cous mixture) and stir to combine.",
    "Next, add the sweet potato mixture to a food processor, blend until almost smooth, and then place the mixture back in the original bowl. If all the mixture does not fit in the food processor, you may need to process the mixture in batches.",
    "Once the mixture is processed, form it into 4 evenly sized patties and place on a baking sheet. Bake for 10 minutes, flip the patties, and then bake for an additional 5 min. Note: Be careful, the patties become more fragile as they dry out.",
    "While the patties are baking, add 1 T olive oil to a medium fry pan and heat on medium heat. Slice the large red onion into 1/4 inch slices and add to the fry pan with a sprinkle of salt.  Sauté the onion slices until just beginning to turn translucent. Then, remove the onions from the heat and set aside. ",
    "Finally, toast the english muffins.",
    "Once all the pieces are prepared, assemble the burger in the following order: bottom of the english muffin, thin layer of spicy mayo, burger, handful of onions, handful of arugula, thin layer of spicy mayo on the top of the muffin, and then the top of the muffin.",
    "Enjoy!"
  ]
}
