{
  "sauceIngredients": [
    "3 T Sugar",
    "2 tsp Lemon Juice",
    "2 tsp Cornstarch",
    "1/2 Cup Water",
    "1 1/4 Cups Fresh or Frozen Blueberries",
    "1/2 tsp Finely Grated Lemon Pee",
    "For the Brussel Sprouts..."
  ],
  "ingredients": [
    "16 Large Brussel Sprouts, ends trimmed and outer leaves removed",
    "4 oz of Goat Cheese",
    "1/2 tsp Minced Garlic",
    "8 Bacon Slices, Cut in Half Crosswise"
  ],
  "instructions": [
    "Mince the garlic and combine in a small bowl with the goat cheese. Place in a small plastic bag (or whatever you will use to pipe the cheese into the brussel sprouts.) Set aside.",
    "Bring a large pot of water to a boil. While you are waiting for it to boil, trim and clean the brussel sprouts.",
    "Put the brussel sprouts in the boiling water for 2 min, then remove immediately and place in a bowl, strainer, or on a plate to dry.",
    "Preheat the oven to 400 degrees F.",
    "Once the brussel sprouts are cool, and mostly dry, use a small pairing knife to make an \"X\" on the top of each. This X sould span most of the top and be deeper in the center than on the sides. By doing it this way, you will have an easier place to put the cheese, but it won't all come falling out the sides.",
    "Cut a small hole in one corner of the bag with the goat cheese.",
    "Place the corner of the bag with the hole in the middle of each brussel sprout and squeeze gently to fill.",
    "Wrap each brussel sprout with a piece of bacon (length or cross-wise is fine), and place on a baking sheet.",
    "Bake for 25 - 30 min (or until the bacon is crispy), flipping halfway through.",
    "While the brussel sprouts are baking, make the blueberry sauce. First, combine lemon juice, sugar, and cornstarch in a medium sauce pan and stir until the sugar has dissolved.",
    "Add the water and blueberries to the saucepan and bring to a boil. Once boiling, reduce heat to low and simmer for 2 - 5 min.",
    "Once the brussel sprouts are cooked, remove from the oven and serve with the accompanying sauce. Enjoy!"
  ]
}
