{
  "ingredients": [
    "Cojita Cheese",
    "1 Butternut Squash",
    "1 Avocado",
    "1 Ear of Corn",
    "1 Watermelon Radish or 3-4 Regular Radishes",
    "1 Batch of Dressing",
    "8 - 10 Corn Tortillas",
    "1/4 cup Apple Cider Vinegar",
    "1/4 cup warm water",
    "1 tsp sugar",
    "Salt and Pepper"
  ],
  "instructions": [
    "Preheat the oven to 425F.",
    "Peel the butternut squash and cut it into 1/2 inch pices. Then place on a baking sheet, and season with olive oil, salt and pepper.",
    "Bake the butternut squash until tender, about 15 to 20 min, flipping once at the half-way mark.",
    "Slice the radish into the thinnest half moons you can manage, using a mandoline if you have one.)",
    "Combine the apple cider vinegar, water, sugar, and a sprinkle of salt in a small bowl and stir until the sugar disolves.",
    "Add the radishes to the vinegar mixture and put in the fridge for about 30 min or more.",
    "Shuck the corn, rub butter on the entire thing, and salt all sides. Then place the corn on a baking sheet.",
    "Make the cilantro lime dressing per the instructions in the link, but use a whole jalapeno instead of half.",
    "Once the butternut squash is finished, turn off the oven and turn the broiler to high. Broil the corn until lightly toasted. DO NOT WALK AWAY while the corn toasts. Be sure to rotate the corn to toast all sides.",
    "Once the corn is toasted, set aside to let cool.",
    "Pit the avocado and thinly slice it. Chop the cojita cheese until it crumbles into a course texture. Set both aside.",
    "Heat a large non-stick skillet on medium high. Once warm, place 3 tortillas (or as many will fit) in the pan and toast until a few brown spots appear on each side. Repeat this for all the tortillas.",
    "Lastly, cut the corn off the cob. I like to rest the corn in a dish with raised edges while I do this so the corn doesn't go everywhere.",
    "You should have everything for the tacos now. Was that enough work? ;)",
    "Gather the radishes, corn, dressing, squash, tortillas, cheese, and avocado and put them on the table for people to make their own tacos.",
    "Enjoy!"
  ]
}
