{
  "ingredients": [
    "1 T Za'atar",
    "Zest of 2 lemons",
    "Juice of 1 1/2 - 2 lemons",
    "4 Tbsp Butter",
    "1/4 Cup White Wine",
    "2 Tbsp Garlic",
    "Salt and Pepper",
    "4 Chicken Breasts Skin on",
    "1 Egg",
    "2 Tbsp Minced Parsley (plus a bit extra for topping)",
    "1 Shallot",
    "8 oz Goat Cheese"
  ],
  "instructions": [
    "Preheat oven to 400 degrees F.",
    "With a paring knife, make a pocket in the thin side of each chicken breast. The pocket should start and end about an inch from each end of the chicken breast and go almost all the way through the breast horizonally.",
    "Whisk the egg in a bowl and then add the parsley, goat cheese, za'atar, shallot, and lemon zest. Mix that until it is combined, place in a plastic bag, and cut one corner of the plastic bag so that it resembles a piping bag. I like to make the hole about a half inch wide since the mixture is rather thick.",
    "Pipe the stuffing into the chicken breasts. The mixture is sticky, so you may have to resort to using your hands.",
    "To help the chicken stay closed as it cooks, you can optionally use toothpicks to keep the pocket closed by sticking the toothpick through the two sides of the open pocket.",
    "Heat 1 T olive oil in a large skillet.",
    "Place the chicken breasts in the skillet skin side down and cook until the skin turns golden brown, usually about 10 min.",
    "If your skillet is oven-proof, flip the breasts, place the skillet in the oven, and bake for an additional 8 to 10 minutes or until the chicken reaches 165 degrees F. If your skillet is not oven proof, flip the chicken breasts and place them into a casserole dish and bake until 160 - 165 degrees F.",
    "Once the chicken is cooked, remove from the oven, place the chicken on a serving platter and reheat the skillet on low heat. ",
    "Add the butter, white wine, and remaining lemon juice to the skillet and allow to simmer for 2 - 3 min. Once finished, drizzle the sauce on top of the chicken, and sprinkle with a tad of fresh lemon juice if you wish."
  ]
}
