{
  "ingredients": [
    "2 large apples (Granny Smith or Pink Lady are best)",
    "",
    "1/4 cup granulated sugar, plus more for caramelizing",
    "Pinch sea salt or kosher salt",
    "4 large egg yolks",
    "1 tablespoon instant espresso or coffee powder",
    "2 teaspoons Kahlua or other coffee-flavored liqueur"
  ],
  "instructions": [
    "Preheat the oven. 300F for gratin dishes, 325F for ramekins or custard cups.",
    "For this recipe, use 4 individual gratin dishes, or six 4-ounce ramekins (do NOT use larger ones).",
    "Place dishes on a high-rimmed baking sheet or in a roasting pan large enough to contain all of them.",
    "Combine the cream, milk, sugar, and salt in a small saucepan and warm on medium heat until the sugar and salt dissove (about 1-2 minutes).",
    "In a bowl, whisk together the egg yolks.",
    "Slowly add the cream to the egg yolks in a slow stream while whisking gently and being careful not to create any foam.",
    "Stir in the liqueur and espresso, then transfer mixture to a container with a spout for easy pouring (seriously, don't skip this.)",
    "Divide the mixture evenly among the dishes. If you are using larger ramekins then is recommended - use more ramekins and fill them less, otherwise you will be waiting all day for them to bake.",
    "",
    "Place the pan containing the custards n the oven rack and fill the pan with enough water to reach at least half way up the sides of the dish. If you are using gratin dishes, bake for 20 - 25 minutes or until just set. If you are using ramekins, snugly cover the pan with aluminum foil and bake for 30 to 35 minutes. When the pan is jiggled they should just barely quiver. NOTE: these times are sometimes inaccurate. They are the recommended times per normal creme brulée however in my oven the baking took quite a bit longer.   ",
    "",
    "Once baked, carefully remove the dishes from the pan    using a metal spatula or tongs (and on oven mitt for support) and set them on a cooling rack. Let the custards cool to room temperature. Then loosely cover and refrigerate overnight.",
    "",
    "When ready to serve, top all the custards with about 1.5 teaspoons of parmesan. Then cover the parmesan with 2 tsps granulated sugar (or enough to coat the surface).",
    "Then use a blow torch to melt the top until it forms a solid layer and is a nice golden brown. You can also use the broiler BUT you must watch each custard like a hawk as they burn extremly fast.",
    "Serve with a spoonful of the topping mixture on each."
  ]
}
