{
  "ingredients": [
    "4 oz. Unsweetened Baker's Chocolate",
    "3 Egg Yolks",
    "1 cup Crisco Vegetable Shortening",
    "1 cup White Sugar",
    "1 cup Molasses",
    "1/2 cup Hot Tap Water",
    "4 cups Flour",
    "1 tsp. Allspice",
    "1 tsp. Vanilla",
    "1 tsp. Salt",
    "2 tsp. Baking Soda"
  ],
  "instructions": [
    "Boil a small saucepan of water.",
    "Combine the chocolate (chopped) and the shortening in a metal mixing bowl with a round bottom.",
    "Place the mixing bowl over the boiling water, making sure the water doesn’t touch the bottom of the bowl, and stir until the shortening and chocolate are completely melted.",
    "Then add the molasses, hot water, vanilla, and egg yolks (beaten.)",
    "In a separate bowl, combine all the dry ingredients except the sugar.",
    "Then add the dry ingredients and the sugar to the first (wet) mixture slowly, beating well.",
    "Let the dough cool in the refrigerator for about an hour.",
    "Preheat the oven to 350 degrees F.",
    "Flour a counter surface, and roll the dough out about 1/4 inch thick.",
    "Cut out doughnut shaped cookies. If you don’t have a doughnut cutter, you can use a normal round cookie cutter and then just use a separate cutter to make the hole in the center.",
    "Finally, place the cookies on a baking sheet and bake until puffy.  It should be about 7-10 min.  Be mindful that the cookies will harden as they cool so they should not be hard when you take them out.",
    "Make the frosting according to the recipe below.",
    "Once the cookies have cooled, frost them."
  ],
  "frostingIngredients": [
    "3 Cups Confectioner's Sugar",
    "3 Tablespoons Whole Milk",
    "1/2 Tsp Vanilla",
    "1/3 Cup Softened Butter"
  ],
  "frostingInstructions": [
    "Beat butter in a mixing bowl until it resembles frosting (it is smooth and spread on the bottom of the bowl.)",
    "Add the milk, confectioners, and vanilla to the bowl and beat, slowly at first (to avoid getting confectioners all over the kitchen) and then faster until frosting is completely combined. At this stage it should resemble cream cheese frosting in texture.",
    "Frost the cookies."
  ]
}
